import 'package:flutter/material.dart';

class Character {
  final String name;
  final String imagePath;
  final String description;
  final List<Color> colors;
  Character({this.name, this.imagePath, this.description, this.colors});
}

List characters = [
  Character(
      name: "أسد",
      imagePath: "assets/images/Panther.png",
      description:
          "ينتمي النمر (بالإنجليزيّة: leopard) إلى طائفة الثدييات، وفصيلة السنوريات، وجنس النمور الذي يضمّ بالإضافة للنمر كلّ من الأسد، واليغور، والببر،ويعيش النمر في أفريقيا جنوب الصحراء الكبرى، وفي أجزاء من شمال وشمال شرق أفريقيا، ويمتد نطاق وجوده من آسيا الصغرى عبر آسيا الوسطى والهند إلى الصين ومنشوريا",
      colors: [Colors.orange.shade200, Colors.deepOrange.shade400]),
  Character(
      name: "بقرة",
      imagePath: "assets/images/Buffalo.png",
      description:
          "حيوان البقرة (Cow) هو أحد أكبر الحيوانات الداجنة (Domestic animals) حول العالم، ويطلق اسم البقرة على الأنثى البالغة في العادة، بينما يطلق على الذكر البالغ اسم الثور (bull)، والصغير اسم العجل (calf)، وينتمي حيوان البقرة إلى فصيلة مزدوجات الأصابع (Artiodactyla).[١] تعيش الأبقار بجانب البشر في جميع أنحاء العالم، وخصوصًا الهند، الصين والبرازيل، ووصل عدد أفراد حيوان البقرة بحلول عام 2016 م إلى حوالي 1 مليار فرد، وتعد اقتصاديًا إحدى أهم الحيوانات الداجنة،[١] ويبلغ متوسط عمر حيوان البقرة 26 عامًا[٢]، وغالبًا ما تنام ليلًا لمدة أربع ساعات فقط يوميًا ما هي الصفات الشكلية لحيوان البقرة؟ ينتمي حيوان البقرة إلى مزدوجات الأصابع، والتي تتضمن مجموعة من الثدييات التي تمشي على أربع أقدام، وتمتلك أربعة حوافر مشقوقة الأصابع، بالإضافة إلى أن حيوان البقرة من الحيوانات المجترة، كالظبي والماعز، وفي الفقرات الآتية أبرز الصفات الشكلية لحيوان البقرة.[١] اللون من الصفات الشكلية لحيوان البقرة صفة تميز الألوان، وتختلف ألوان حيوان البقرة بحسب اختلاف نوعه، فعلى سبيل المثال تمتلك بقرة هيرفورد جسدًا أحمر ورأس أبيض، وأما جسد بقرة شارولايس فهو أبيض اللون، إلى جانب ذلك تمتلك بعض الأبقار البيضاء نمطًا مميزًا من البقع سوداء اللون، ومثال عليها بقرة برادفورد، وتختلف ألوان بعض أنواع حيوان البقرة دون اتباع نمط ثابت محدد، ويحاول العلماء الاستعانة بالتعديل الجيني للحفاظ على لون محدد دون غيره لكل نوع.[٤] الحجم يعد الحجم من الصفات الشكلية لحيوان البقرة، ويختلف حجم حيوان البقرة باختلاف نوعه، وفي عام 2004 م أجريت دراسة على 110 بقرات من تسعة أنواع مختلفة، ووجُد أن أثقل فرد منهم هي أنثى أطلق عليها اسم آكيتاين، ويصل ارتفاعها من الأرض إلى الكتفين إلى 142.5 سم، بينما يصل ارتفاعها من جهة الأرداف إلى 146.6 سم، وأما طولها فوصل إلى 151.5 سم.[٥] أما حيوان البقرة من نوع الليموزين امتلك أردافًا أكبر مقارنة مع بقية الأنواع، حيث وصل طول الردف إلى 47.4 سم، وعرضه 58.3 سم، وأخيرًا حيوان البقرة من نوع شيفر الذي تميز بأوسع مسافة بين كتفيه مقارنة مع بقية الأفراد، فوصلت المسافة بين كتفيه إلى 52.9 سم.[٥] الوزن على غرار بقية الصفات الشكلية لحيوان البقرة، فالوزن أيضًا يختلف باختلاف نوع حيوان البقرة، وبشكل عام يمكن أن يتراوح وزن ذكر حيوان البقرة الناضج ما بين 450 إلى 1800 كيلو جرام، بينما يتراوح وزن الأنثى ما بين 360 إلى 1100 كيلو جرام.[١] وفي المثال الذكور في الفقرة السابقة وصل وزن البقرة أكيتاين إلى 638 كيلو جرام.[٥] يمتلك ذكر وأنثى حيوان البقرة قرونًا، ولكنها تكون قصيرة لدى بعض الأنواع، أو منعدمة لدى أنواعٍ أخرى، وفي بعض الأحيان يقوم مربو حيوان البقرة بإزالة قرونه في صغره، لكي لا يتسبب في إصابة بقية القطيع، وفي المقابل تمتلك بعض أنواع حيوان البقرة قرونًا كبيرة للغاية، ومثال عليها البقرة الإفريقية وبقرة تكساس ذات القرون الطويلة",
      colors: [Colors.pink.shade200, Colors.redAccent.shade400]),
];
